jetacpp/imxrt1010-fft-camera/source/virtual_camera.c
    switch (setup->bmRequestType)
    {
        case USB_DEVICE_VIDEO_GET_REQUEST_INTERFACE:
            if (USB_VIDEO_VIRTUAL_CAMERA_CONTROL_INTERFACE_INDEX == interface_index)
            {
                error = USB_DeviceProcessClassVcRequest(handle, setup, length, buffer);
            }
            else if (USB_VIDEO_VIRTUAL_CAMERA_STREAM_INTERFACE_INDEX == interface_index)
            {
                error = USB_DeviceVideoProcessClassVsRequest(handle, setup, length, buffer);
            }
            else
            {
            }
            break;
        case USB_DEVICE_VIDEO_SET_REQUEST_INTERFACE:
            if (USB_VIDEO_VIRTUAL_CAMERA_CONTROL_INTERFACE_INDEX == interface_index)
            {
                error = USB_DeviceProcessClassVcRequest(handle, setup, length, buffer);
            }
            else if (USB_VIDEO_VIRTUAL_CAMERA_STREAM_INTERFACE_INDEX == interface_index)
            {
                error = USB_DeviceVideoProcessClassVsRequest(handle, setup, length, buffer);
            }
            else
            {
            }
            break;
        default:
            break;
    }

    return error;
}

static void USB_DeviceApplicationInit(void)
{
    USB_DeviceClockInit();
#if (defined(FSL_FEATURE_SOC_SYSMPU_COUNT) && (FSL_FEATURE_SOC_SYSMPU_COUNT > 0U))
    SYSMPU_Enable(SYSMPU, 0);
#endif /* FSL_FEATURE_SOC_SYSMPU_COUNT */

    USB_DeviceVideoApplicationSetDefault();

    if (kStatus_USB_Success !=
        USB_DeviceInit(CONTROLLER_ID, USB_DeviceCallback, &g_UsbDeviceVideoVirtualCamera.deviceHandle))
    {
        usb_echo("USB device video virtual camera failed\r\n");
        return;
    }
    else
    {
        usb_echo("USB device video virtual camera demo\r\n");
    }

    USB_DeviceIsrEnable();

    USB_DeviceRun(g_UsbDeviceVideoVirtualCamera.deviceHandle);
}

extern float do_fft(
    uint32_t sampleRate, uint32_t bitWidth, uint8_t *buffer, float *fftData, float *fftResult);
extern void gen_sine(uint8_t * in, uint32_t in_len, int fs);
extern void do_jpeg(float* signal, uint32_t signal_len, uint8_t* frame, uint32_t frame_len);

static float maxFreq;
static float ffData[2 * BUFFER_SIZE];
static float ffResult[BUFFER_SIZE];

#if defined(__CC_ARM) || (defined(__ARMCC_VERSION)) || defined(__GNUC__)
int main(void)
#else
void main(void)
#endif
{
    BOARD_ConfigMPU();

    BOARD_InitPins();
    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();

    app_sai_init();

    USB_DeviceApplicationInit();

    while (1U)
    {
#if USB_DEVICE_CONFIG_USE_TASK
        USB_DeviceTaskFn(g_UsbDeviceVideoVirtualCamera.deviceHandle);
#endif

    if (emptyBlock > 0)
            {
                xfer.data     = Buffer + rx_index * BUFFER_SIZE;
                xfer.dataSize = BUFFER_SIZE;
                if (kStatus_Success == SAI_TransferReceiveEDMA(DEMO_SAI, &rxHandle, &xfer))
                {
                    rx_index++;
                }
                if (rx_index == BUFFER_NUMBER)
                {
                    rx_index = 0U;
                }
            }
            if (emptyBlock < BUFFER_NUMBER)
            {
                xfer.data     = Buffer + tx_index * BUFFER_SIZE;
                xfer.dataSize = BUFFER_SIZE;
                
                 if (kStatus_Success == SAI_TransferSendEDMA(DEMO_SAI, &txHandle, &xfer))
                 {
                     //tx_index++;
                 }

                //gen_sine(xfer.data, xfer.dataSize, 250);
                /* Compute the frequency of the data using FFT */
                maxFreq = do_fft(DEMO_AUDIO_SAMPLE_RATE, DEMO_AUDIO_BIT_WIDTH, xfer.data, ffData, ffResult);
                // {
                // 	static float prev;
                // 	if (prev != maxFreq && maxFreq < 15000) {
                // 		usb_echo("%d\r\n", (int)(maxFreq));
                // 		prev = maxFreq;
                // 	}
                // }

                tx_index++;

                if (tx_index == BUFFER_NUMBER)
                {
                    tx_index = 0U;
                }

            }
        }
}
